In [10]:
import numpy as np
import pandas as pd
V1 = np.array([1,3,6,np.NaN,7,1,np.NaN,9,15])
V2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
V4 = np.array(["IT","IT","IK","IK","IK","IK","IK","IT","IT"])
df=pd.DataFrame(
    {
        "maas":V1,
        "V2":V2,
        "V3":V3,
        "departman":V4
    }
)
df

   maas    V2    V3 departman
0   1.0   7.0   NaN        IT
1   3.0   NaN  12.0        IT
2   6.0   5.0   5.0        IK
3   NaN   8.0   6.0        IK
4   7.0  12.0  14.0        IK
5   1.0   NaN   7.0        IK
6   NaN   NaN   NaN        IK
7   9.0   2.0   2.0        IT
8  15.0   3.0  31.0        IT

In [2]:
df.groupby("departman")["maas"].mean()# departmanlara göre maaş ortalaması

departman
IK    4.666667
IT    7.000000
Name: maas, dtype: float64

In [6]:
df["maas"].fillna(df.groupby("departman")["maas"].transform("mean"))# departmanlara göre maaş ortalaması ile dolduruldu

0     1.000000
1     3.000000
2     6.000000
3     4.666667
4     7.000000
5     1.000000
6     4.666667
7     9.000000
8    15.000000
Name: maas, dtype: float64